Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectBase.MoveObjectRelative Method
 Moves the object according to the given move vector.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveObjectRelative(
	Vector moveVector
)
Public Function MoveObjectRelative (
	moveVector As Vector
) As Boolean
Parameters
moveVector
Type: Tekla.Structures.Geometry3d.Vector
The move vector to be used.
Return Value
Type: Boolean
True.
Implements
IMovableRelative.MoveObjectRelative(Vector)
Examples
 The following example calculates a move vector from two points. The move vector in the example will move an object 1000 points in the +X direction.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           DwgObject exampleObject = new DwgObject(MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase,
               new Point(100, 100), "filename");
           Vector moveVector = new Vector(new Point(1000, 0) - new Point(0, 0));
           exampleObject.MoveObjectRelative(moveVector);
       }
}
See Also
Reference
EmbeddedObjectBase Class
Tekla.Structures.Drawing Namespace